[
  {
    "id": "q001",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI report that contains multiple visuals, including a table and a bar chart. You want to apply the same visual style (e.g., font, color scheme) to all visuals in the report. What should you do?",
        "de": "Sie haben einen Power BI-Bericht mit mehreren Visuals, einschließlich einer Tabelle und eines Balkendiagramms. Sie möchten den gleichen visuellen Stil (z.B. Schriftart, Farbschema) auf alle Visuals im Bericht anwenden. Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Manually adjust the formatting settings for each visual individually.",
      "Use a report template to apply the desired visual style to all visuals in the report.",
      "Copy and paste the formatting from one visual to other visuals in the report.",
      "Apply a theme to the report to automatically style all visuals based on predefined settings."
    ],
    "choices_ger": [
      "Manuell die Formatierungseinstellungen für jedes Visual einzeln anpassen.",
      "Eine Berichtsvorlage verwenden, um den gewünschten visuellen Stil auf alle Visuals im Bericht anzuwenden.",
      "Die Formatierung von einem Visual auf andere Visuals im Bericht kopieren und einfügen.",
      "Ein Thema auf den Bericht anwenden, um automatisch alle Visuals basierend auf vordefinierten Einstellungen zu gestalten."
    ],
    "isMulti": false,
    "correct": [
      3
    ]
  },
  {
    "id": "q002",
    "content": [
      {
        "type": "text",
        "eng": "You have a SharePoint document library that contains Excel workbooks. The workbooks are updated daily with new data. You want to automate the process of importing the data from the Excel workbooks into Power BI. What should you do to achieve this?",
        "de": "Sie haben eine SharePoint-Dokumentbibliothek mit Excel-Arbeitsmappen. Die Arbeitsmappen werden täglich mit neuen Daten aktualisiert. Sie möchten den Importprozess der Daten aus den Excel-Arbeitsmappen in Power BI automatisieren. Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Use Power Query to connect to the SharePoint document library and set up scheduled data refresh in Power BI.",
      "Convert the Excel workbooks into Power BI datasets and set up scheduled refresh in the Power BI service.",
      "Use Power Automate to trigger a refresh of the data in Power BI whenever a new file is added to the SharePoint document library.",
      "Manually import the data from the Excel workbooks into Power BI whenever updates are made to the files."
    ],
    "choices_ger": [
      "Power Query verwenden, um eine Verbindung zur SharePoint-Dokumentbibliothek herzustellen und geplante Datenaktualisierung in Power BI einzurichten.",
      "Die Excel-Arbeitsmappen in Power BI-Datasets umwandeln und geplante Aktualisierung im Power BI-Service einrichten.",
      "Power Automate verwenden, um eine Aktualisierung der Daten in Power BI auszulösen, wenn eine neue Datei zur SharePoint-Dokumentbibliothek hinzugefügt wird.",
      "Die Daten manuell aus den Excel-Arbeitsmappen in Power BI importieren, wenn Aktualisierungen an den Dateien vorgenommen werden."
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q003",
    "content": [
      {
        "type": "text",
        "eng": "You are building a Power BI report that requires data from a web-based API. However, you notice that there is no specific connector available for the API in the Get Data connector list. What should you do to retrieve data from the API into Power BI?",
        "de": "Sie erstellen einen Power BI-Bericht, der Daten von einer webbasierten API benötigt. Es gibt jedoch keinen spezifischen Connector für die API in der Liste der Datenquellen. Was sollten Sie tun, um die Daten von der API in Power BI abzurufen?"
      }
    ],
    "images": [],
    "choices": [
      "Use the Web connector to connect to the API and retrieve the data",
      "Export the data from the API to a supported file format (e.g., JSON or CSV), and then use the corresponding connector to import the data into Power BI.",
      "Create a custom connector using Power Query M language to connect to the API and retrieve the data.",
      "Utilize Power Automate to fetch the data from the API and push it to a supported data source that can be connected to Power BI."
    ],
    "choices_ger": [
      "Den Web-Connector verwenden, um eine Verbindung zur API herzustellen und die Daten abzurufen.",
      "Die Daten von der API in ein unterstütztes Dateiformat (z.B. JSON oder CSV) exportieren und dann den entsprechenden Connector verwenden, um die Daten in Power BI zu importieren.",
      "Einen benutzerdefinierten Connector mit der Power Query M-Sprache erstellen, um eine Verbindung zur API herzustellen und die Daten abzurufen.",
      "Power Automate verwenden, um die Daten von der API abzurufen und an eine unterstützte Datenquelle zu senden, die mit Power BI verbunden werden kann."
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q004",
    "content": [
      {
        "type": "text",
        "eng": "Your company has implemented a custom connector that retrieves employee attendance data, including check-in and check-out timestamps. You need to create a Power BI report that presents attendance trends without disclosing the specific timestamps to the report recipients. How can you accomplish this while maintaining data privacy?",
        "de": "Ihr Unternehmen hat einen benutzerdefinierten Connector implementiert, der Mitarbeiter-Anwesenheitsdaten abruft, einschließlich Check-in- und Check-out-Zeitstempeln. Sie müssen einen Power BI-Bericht erstellen, der Anwesenheitstrends darstellt, ohne die spezifischen Zeitstempel den Berichtsempfängern preiszugeben. Wie können Sie dies erreichen und gleichzeitig die Datenschutzbestimmungen einhalten?"
      }
    ],
    "images": [],
    "choices": [
      "Calculate and display average check-in and check-out times without revealing the individual timestamps.",
      "Apply data aggregation techniques to summarize attendance data at different time intervals (e.g., daily, weekly) and present the aggregated trends in the report.",
      "Implement dynamic data masking on the check-in and check-out timestamps to conceal the specific values while still showing attendance patterns.",
      "Exclude the check-in and check-out timestamps from the report dataset and focus on visualizing attendance trends based on other relevant metrics, such as daily attendance count or absenteeism rate."
    ],
    "choices_ger": [
      "Durchschnittliche Check-in- und Check-out-Zeiten berechnen und anzeigen, ohne die einzelnen Zeitstempel preiszugeben.",
      "Datenaggregationstechniken anwenden, um Anwesenheitsdaten in verschiedenen Zeitintervallen (z.B. täglich, wöchentlich) zusammenzufassen und die aggregierten Trends im Bericht darzustellen.",
      "Dynamisches Datenmaskieren für die Check-in- und Check-out-Zeitstempel implementieren, um die spezifischen Werte zu verbergen, während Anwesenheitsmuster angezeigt werden.",
      "Die Check-in- und Check-out-Zeitstempel aus dem Berichtsdatensatz ausschließen und sich auf die Visualisierung von Anwesenheitstrends basierend auf anderen relevanten Metriken konzentrieren, wie z.B. tägliche Anwesenheitszahl oder Abwesenheitsrate."
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  },
  {
    "id": "q005",
    "content": [
      {
        "type": "text",
        "eng": "You are working on a Power BI project that requires connecting to an Oracle database. However, when you try to establish the connection, you notice that there is no specific Oracle connector available in the Get Data connector list. What should you do to connect Power BI to the Oracle database?",
        "de": "Sie arbeiten an einem Power BI-Projekt, das eine Verbindung zu einer Oracle-Datenbank erfordert. Beim Versuch, die Verbindung herzustellen, stellen Sie fest, dass in der Liste der Datenquellen kein spezifischer Oracle-Connector verfügbar ist. Was sollten Sie tun, um Power BI mit der Oracle-Datenbank zu verbinden?"
      }
    ],
    "images": [],
    "choices": [
      "Use the ODBC connector to establish a connection to the Oracle database.",
      "Install the Oracle client software on your machine and then select the Oracle connector from the Get Data connector list.",
      "Export the data from the Oracle database to a supported file format (e.g., CSV or Excel), and then use the corresponding connector to import the data into Power BI.",
      "Create a custom connector using Power Query M language to connect to the Oracle database."
    ],
    "choices_ger": [
      "Den ODBC-Connector verwenden, um eine Verbindung zur Oracle-Datenbank herzustellen.",
      "Die Oracle-Client-Software auf Ihrem Computer installieren und dann den Oracle-Connector aus der Liste der Datenquellen auswählen.",
      "Die Daten aus der Oracle-Datenbank in ein unterstütztes Dateiformat (z.B. CSV oder Excel) exportieren und dann den entsprechenden Connector verwenden, um die Daten in Power BI zu importieren.",
      "Einen benutzerdefinierten Connector mit der Power Query M-Sprache erstellen, um eine Verbindung zur Oracle-Datenbank herzustellen."
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q006",
    "content": [
      {
        "type": "text",
        "eng": "You have a Microsoft Power BI report stored in an App workspace with shared capacity. The report utilizes an imported dataset that includes a large fact table with 12 million rows. Users have experienced sluggish performance when interacting with the report‘s visuals. What action should you suggest to enhance the report‘s performance?",
        "de": "Sie haben einen Microsoft Power BI-Bericht in einem App-Arbeitsbereich mit gemeinsam genutzter Kapazität gespeichert. Der Bericht verwendet einen importierten Datensatz mit einer großen Faktentabelle mit 12 Millionen Zeilen. Benutzer haben langsame Leistung bei der Interaktion mit den Visuals des Berichts festgestellt. Welche Maßnahme sollten Sie vorschlagen, um die Leistung des Berichts zu verbessern?"
      }
    ],
    "images": [],
    "choices": [
      "Enable visual interactions to optimize the response time.",
      "Refactor the DAX measures to utilize iterator functions for faster calculations.",
      "Apply row-level security (RLS) to limit data access for improved performance.",
      "Remove any unnecessary columns from the tables in the data model to reduce the file size."
    ],
    "choices_ger": [
      "Visuelle Interaktionen aktivieren, um die Antwortzeit zu optimieren.",
      "Die DAX-Kennzahlen überarbeiten, um Iterator-Funktionen für schnellere Berechnungen zu nutzen.",
      "Zeilenebenen-Sicherheit (RLS) anwenden, um den Datenzugriff zu beschränken und die Leistung zu verbessern.",
      "Unnötige Spalten aus den Tabellen im Datenmodell entfernen, um die Dateigröße zu reduzieren."
    ],
    "isMulti": false,
    "correct": [
      3
    ]
  },
  {
    "id": "q007",
    "content": [
      {
        "type": "text",
        "eng": "You are building a Power BI report that includes data from multiple sources, including an on-premises SQL Server database and a cloud-based CRM system. The on-premises SQL Server database is behind a firewall and can only be accessed through a VPN connection. What should you do to ensure that the Power BI report can retrieve data from both sources?",
        "de": "Sie erstellen einen Power BI-Bericht, der Daten aus mehreren Quellen enthält, einschließlich einer lokalen SQL Server-Datenbank und eines cloudbasierten CRM-Systems. Die lokale SQL Server-Datenbank befindet sich hinter einer Firewall und kann nur über eine VPN-Verbindung erreicht werden. Was sollten Sie tun, um sicherzustellen, dass der Power BI-Bericht Daten aus beiden Quellen abrufen kann?"
      }
    ],
    "images": [],
    "choices": [
      "Install and configure an on-premises data gateway to establish a secure connection between the Power BI service and the on-premises SQL Server database.",
      "Export the data from the on-premises SQL Server database and import it into the cloud-based CRM system. Connect Power BI directly to the cloud-based CRM system to retrieve the combined data.",
      "Use Power Automate to extract data from the on-premises SQL Server database and push it to a cloud-based data storage solution. Connect Power BI to the cloud-based data storage solution to retrieve the combined data.",
      "Create a VPN connection from the Power BI service to the on-premises SQL Server database. Configure the Power BI report to use the VPN connection for data retrieval."
    ],
    "choices_ger": [
      "Ein lokales Datengateway installieren und konfigurieren, um eine sichere Verbindung zwischen dem Power BI-Service und der lokalen SQL Server-Datenbank herzustellen.",
      "Die Daten aus der lokalen SQL Server-Datenbank exportieren und in das cloudbasierte CRM-System importieren. Power BI direkt mit dem cloudbasierten CRM-System verbinden, um die kombinierten Daten abzurufen.",
      "Power Automate verwenden, um Daten aus der lokalen SQL Server-Datenbank zu extrahieren und an eine cloudbasierte Datenspeicherlösung zu senden. Power BI mit der cloudbasierten Datenspeicherlösung verbinden, um die kombinierten Daten abzurufen.",
      "Eine VPN-Verbindung vom Power BI-Service zur lokalen SQL Server-Datenbank erstellen. Den Power BI-Bericht so konfigurieren, dass er die VPN-Verbindung für den Datenabruf verwendet."
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q008",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI report that includes a table visual displaying sales data. The sales data is grouped by region and includes the columns: Region, Salesperson, and SalesAmount. You want to add a calculated column to the table that calculates the percentage of each salesperson‘s sales amount out of the total sales amount for the region. Which DAX formula should you use?",
        "de": "Sie haben einen Power BI-Bericht mit einer Tabellenvisualisierung, die Verkaufsdaten anzeigt. Die Verkaufsdaten sind nach Region gruppiert und enthalten die Spalten: Region, Vertriebsmitarbeiter und Verkaufsbetrag. Sie möchten der Tabelle eine berechnete Spalte hinzufügen, die den Prozentsatz des Verkaufsbetrags jedes Vertriebsmitarbeiters am Gesamtverkaufsbetrag der Region berechnet. Welche DAX-Formel sollten Sie verwenden?"
      }
    ],
    "images": [],
    "choices": [
      "Salesperson Sales Percentage = DIVIDE([SalesAmount], CALCULATE(SUM([SalesAmount]), ALLEXCEPT(Table1, [Region])))",
      "Salesperson Sales Percentage = DIVIDE([SalesAmount], SUMX(FILTER(Table1, Table1[Region] = EARLIER(Table1[Region])), [SalesAmount]))",
      "Salesperson Sales Percentage = DIVIDE([SalesAmount], SUMX(FILTER(ALL(Table1), Table1[Region] = EARLIER(Table1[Region])), [SalesAmount]))",
      "Salesperson Sales Percentage = DIVIDE([SalesAmount], CALCULATE(SUM([SalesAmount]), Table1[Region] = EARLIER(Table1[Region])))"
    ],
    "choices_ger": [
      "Vertriebsmitarbeiter Verkaufsprozentsatz = DIVIDE([Verkaufsbetrag], CALCULATE(SUM([Verkaufsbetrag]), ALLEXCEPT(Tabelle1, [Region])))",
      "Vertriebsmitarbeiter Verkaufsprozentsatz = DIVIDE([Verkaufsbetrag], SUMX(FILTER(Tabelle1, Tabelle1[Region] = EARLIER(Tabelle1[Region])), [Verkaufsbetrag]))",
      "Vertriebsmitarbeiter Verkaufsprozentsatz = DIVIDE([Verkaufsbetrag], SUMX(FILTER(ALL(Tabelle1), Tabelle1[Region] = EARLIER(Tabelle1[Region])), [Verkaufsbetrag]))",
      "Vertriebsmitarbeiter Verkaufsprozentsatz = DIVIDE([Verkaufsbetrag], CALCULATE(SUM([Verkaufsbetrag]), Tabelle1[Region] = EARLIER(Tabelle1[Region])))"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q009",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI report that is experiencing slow performance when loading visuals. The report uses an imported dataset with a large fact table. What should you recommend to improve the performance of the report?",
        "de": "Sie haben einen Power BI-Bericht, der langsame Leistung beim Laden von Visuals aufweist. Der Bericht verwendet einen importierten Datensatz mit einer großen Faktentabelle. Was sollten Sie empfehlen, um die Leistung des Berichts zu verbessern?"
      }
    ],
    "images": [],
    "choices": [
      "Implement query folding to optimize the data retrieval from the source.",
      "Apply filters to reduce the amount of data loaded into the visuals.",
      "Create summary tables or aggregates to pre-calculate and optimize the data.",
      "Utilize Power BI performance analyzer to identify and optimize slow-performing visuals."
    ],
    "choices_ger": [
      "Query Folding implementieren, um den Datenabruf aus der Quelle zu optimieren.",
      "Filter anwenden, um die Menge der in die Visuals geladenen Daten zu reduzieren.",
      "Zusammenfassungstabellen oder Aggregate erstellen, um die Daten vorab zu berechnen und zu optimieren.",
      "Den Power BI Performance Analyzer verwenden, um langsame Visuals zu identifizieren und zu optimieren."
    ],
    "isMulti": false,
    "correct": [
      2
    ]
  },
  {
    "id": "q010",
    "content": [
      {
        "type": "text",
        "eng": "You have a Microsoft Power BI report that contains a large amount of data and multiple visuals. The report is taking a long time to load and users are experiencing performance issues. What should you do to improve the performance of the report?",
        "de": "Sie haben einen Microsoft Power BI-Bericht, der eine große Menge an Daten und mehrere Visuals enthält. Der Bericht benötigt lange Ladezeiten und Benutzer haben Leistungsprobleme. Was sollten Sie tun, um die Leistung des Berichts zu verbessern?"
      }
    ],
    "images": [],
    "choices": [
      "Increase the shared capacity of the Power BI workspace.",
      "Optimize the DAX calculations and formulas used in the report.",
      "Reduce the number of visuals displayed on the report page.",
      "Use direct query mode instead of importing the data."
    ],
    "choices_ger": [
      "Die gemeinsame Kapazität des Power BI-Arbeitsbereichs erhöhen.",
      "Die DAX-Berechnungen und Formeln im Bericht optimieren.",
      "Die Anzahl der auf der Berichtsseite angezeigten Visuals reduzieren.",
      "Den DirectQuery-Modus anstelle des Datenimports verwenden."
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  },
  {
    "id": "q011",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI report that includes a large dataset with multiple tables. The report is accessed by a large number of users concurrently, and they are experiencing slow performance when interacting with the visuals. What can you do to improve the performance of the report?",
        "de": "Sie haben einen Power BI-Bericht mit einem großen Datensatz und mehreren Tabellen. Der Bericht wird von vielen Benutzern gleichzeitig aufgerufen, und sie haben langsame Leistung bei der Interaktion mit den Visuals. Was können Sie tun, um die Leistung des Berichts zu verbessern?"
      }
    ],
    "images": [],
    "choices": [
      "Implement query folding in Power Query Editor to optimize data retrieval from the dataset.",
      "Enable query caching in the Power BI service to store and reuse query results for faster data access.",
      "Optimize the data model by removing unnecessary relationships and calculations to reduce the complexity of the dataset.",
      "Enable incremental refresh on the dataset to only load and update the data that has changed since the last refresh."
    ],
    "choices_ger": [
      "Query Folding im Power Query Editor implementieren, um den Datenabruf aus dem Datensatz zu optimieren.",
      "Abfrage-Caching im Power BI-Service aktivieren, um Abfrageergebnisse zu speichern und wiederzuverwenden, um einen schnelleren Datenzugriff zu ermöglichen.",
      "Das Datenmodell optimieren, indem unnötige Beziehungen und Berechnungen entfernt werden, um die Komplexität des Datensatzes zu reduzieren.",
      "Inkrementelle Aktualisierung für den Datensatz aktivieren, um nur die Daten zu laden und zu aktualisieren, die sich seit der letzten Aktualisierung geändert haben."
    ],
    "isMulti": true,
    "correct": [
      0,
      1,
      2
    ]
  },
  {
    "id": "q012",
    "content": [
      {
        "type": "text",
        "eng": "You are designing a Power BI report that displays sales data for different regions. The report includes a slicer that allows users to select a specific region. You want to display a visual that shows the sales trend over time for the selected region. Which visualization should you use?",
        "de": "Sie entwerfen einen Power BI-Bericht, der Verkaufsdaten für verschiedene Regionen anzeigt. Der Bericht enthält einen Slicer, mit dem Benutzer eine bestimmte Region auswählen können. Sie möchten ein Visual anzeigen, das den Verkaufstrend über die Zeit für die ausgewählte Region darstellt. Welche Visualisierung sollten Sie verwenden?"
      }
    ],
    "images": [],
    "choices": [
      "Stacked area chart",
      "Scatter plot",
      "Line chart",
      "Waterfall chart"
    ],
    "choices_ger": [
      "Gestapeltes Flächendiagramm",
      "Punktdiagramm",
      "Liniendiagramm",
      "Wasserfalldiagramm"
    ],
    "isMulti": false,
    "correct": [
      2
    ]
  },
  {
    "id": "q013",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI report hosted on powerbi.com that displays expenses by department for department managers.The report contains a line chart that shows expenses by month.You need to enable users to choose between viewing the report as a line chart or a column chart. The solution must minimize development and maintenance effort.What should you do?",
        "de": "Sie haben einen Power BI-Bericht auf powerbi.com, der Ausgaben nach Abteilung für Abteilungsleiter anzeigt. Der Bericht enthält ein Liniendiagramm, das die Ausgaben nach Monat zeigt. Sie müssen Benutzern ermöglichen, zwischen der Anzeige des Berichts als Liniendiagramm oder Säulendiagramm zu wählen. Die Lösung muss den Entwicklungs- und Wartungsaufwand minimieren. Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Enable report readers to personalize visuals.",
      "Create a separate report page for users to view the column chart.",
      "Add a column chart, a bookmark, and a button for users to choose a visual.",
      "Create a mobile report that contains a column chart."
    ],
    "choices_ger": [
      "Berichtslesern ermöglichen, Visuals zu personalisieren.",
      "Eine separate Berichtsseite erstellen, auf der Benutzer das Säulendiagramm anzeigen können.",
      "Ein Säulendiagramm, ein Lesezeichen und eine Schaltfläche hinzufügen, damit Benutzer ein Visual auswählen können.",
      "Einen mobilen Bericht erstellen, der ein Säulendiagramm enthält."
    ],
    "isMulti": false,
    "correct": [
      2
    ]
  },
  {
    "id": "q014",
    "content": [
      {
        "type": "text",
        "eng": "You have a report that contains a bar chart and a column chart. The bar chart shows customer count by customer segment. The column chart shows sales by month. You need to ensure that when a segment is selected in the bar chart, you see which portion of the total sales for the month belongs to the customer segment. How should the visual interactions be set on the column chart when the bar chart is selected?",
        "de": "Sie haben einen Bericht mit einem Balkendiagramm und einem Säulendiagramm. Das Balkendiagramm zeigt die Kundenzahl nach Kundensegment. Das Säulendiagramm zeigt die Verkäufe nach Monat. Sie müssen sicherstellen, dass bei Auswahl eines Segments im Balkendiagramm der Anteil des Gesamtumsatzes des Monats, der zum Kundensegment gehört, angezeigt wird. Wie sollten die visuellen Interaktionen im Säulendiagramm eingestellt werden, wenn das Balkendiagramm ausgewählt ist?"
      }
    ],
    "images": [],
    "choices": [
      "highlight",
      "filter",
      "no impact"
    ],
    "choices_ger": [
      "hervorheben",
      "filtern",
      "keine Auswirkung"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q015",
    "content": [
      {
        "type": "text",
        "eng": "What is the best way to manage workspaces in Power BI?",
        "de": "Was ist die beste Methode, um Arbeitsbereiche in Power BI zu verwalten?"
      }
    ],
    "images": [],
    "choices": [
      "Create a new workspace for each department",
      "Use a single workspace for all departments",
      "Use a single workspace for each report",
      "Use a single workspace for each user"
    ],
    "choices_ger": [
      "Für jede Abteilung einen neuen Arbeitsbereich erstellen",
      "Einen einzigen Arbeitsbereich für alle Abteilungen verwenden",
      "Einen einzigen Arbeitsbereich für jeden Bericht verwenden",
      "Einen einzigen Arbeitsbereich für jeden Benutzer verwenden"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q016",
    "content": [
      {
        "type": "text",
        "eng": "How can you create a hierarchy in Power BI?",
        "de": "Wie kann man eine Hierarchie in Power BI erstellen?"
      }
    ],
    "images": [],
    "choices": [
      "By dragging and dropping columns onto the hierarchy pane",
      "By using the drill-down feature",
      "By creating a new column with a hierarchy formula",
      "By using the grouping feature"
    ],
    "choices_ger": [
      "Durch Ziehen und Ablegen von Spalten in den Hierarchie-Bereich",
      "Durch Verwendung der Drill-Down-Funktion",
      "Durch Erstellen einer neuen Spalte mit einer Hierarchie-Formel",
      "Durch Verwendung der Gruppierungsfunktion"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q017",
    "content": [
      {
        "type": "text",
        "eng": "What is the difference between structured and unstructured data?",
        "de": "Was ist der Unterschied zwischen strukturierten und unstrukturierten Daten?"
      }
    ],
    "images": [],
    "choices": [
      "Structured data has a defined format",
      "Unstructured data has a defined format",
      "Structured data is easy to analyze",
      "Unstructured data is easy to analyze"
    ],
    "choices_ger": [
      "Strukturierte Daten haben ein definiertes Format",
      "Unstrukturierte Daten haben ein definiertes Format",
      "Strukturierte Daten sind einfach zu analysieren",
      "Unstrukturierte Daten sind einfach zu analysieren"
    ],
    "isMulti": true,
    "correct": [
      0,
      2
    ]
  },
  {
    "id": "q018",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI workspace that contains a dataset, a report, and a dashboard. The following groups have access:✑ External users can access the dashboard.✑ Managers can access the dashboard and a manager-specific report.✑ Employees can access the dashboard and a row-level security (RLS) constrained report.You need all users, including the external users, to be able to tag workspace administrators if they identify an issue with the dashboard. The solution must ensure that other users see the issues that were raised.What should you use?",
        "de": "Sie haben einen Power BI-Arbeitsbereich, der einen Datensatz, einen Bericht und ein Dashboard enthält. Folgende Gruppen haben Zugriff:✑ Externe Benutzer können auf das Dashboard zugreifen.✑ Manager können auf das Dashboard und einen managerspezifischen Bericht zugreifen.✑ Mitarbeiter können auf das Dashboard und einen Bericht mit Zeilenebenen-Sicherheit (RLS) zugreifen.Sie möchten, dass alle Benutzer, einschließlich der externen Benutzer, Arbeitsbereichsadministratoren markieren können, wenn sie ein Problem mit dem Dashboard feststellen. Die Lösung muss sicherstellen, dass andere Benutzer die gemeldeten Probleme sehen können.Was sollten Sie verwenden?"
      }
    ],
    "images": [],
    "choices": [
      "comments",
      "chat in Microsoft Teams",
      "alerts",
      "subscriptions"
    ],
    "choices_ger": [
      "Kommentare",
      "Chat in Microsoft Teams",
      "Warnungen",
      "Abonnements"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q019",
    "content": [
      {
        "type": "text",
        "eng": "You create a dashboard by using the Microsoft Power BI Service. The dashboard contains a card visual that shows total sales from the current year.You grant users access to the dashboard by using the Viewer role on the workspace.A user wants to receive daily notifications of the number shown on the card visual.You need to automate the notifications.What should you do?",
        "de": "Sie erstellen ein Dashboard mit dem Microsoft Power BI Service. Das Dashboard enthält eine Kartenvisualisierung, die den Gesamtumsatz des aktuellen Jahres anzeigt.Sie gewähren Benutzern Zugriff auf das Dashboard durch die Viewer-Rolle im Arbeitsbereich.Ein Benutzer möchte tägliche Benachrichtigungen über die in der Kartenvisualisierung angezeigte Zahl erhalten.Sie müssen die Benachrichtigungen automatisieren.Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Create a subscription.",
      "Create a data alert.",
      "Share the dashboard to the user.",
      "Tag the user in a comment."
    ],
    "choices_ger": [
      "Ein Abonnement erstellen.",
      "Eine Datenwarnung erstellen.",
      "Das Dashboard für den Benutzer freigeben.",
      "Den Benutzer in einem Kommentar markieren."
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q020",
    "content": [
      {
        "type": "text",
        "eng": "What is the purpose of a gateway in Power BI?",
        "de": "Welchen Zweck hat ein Gateway in Power BI?"
      }
    ],
    "images": [],
    "choices": [
      "To connect on-premises data sources to Power BI",
      "To create visualizations",
      "To share data with other users",
      "To manage data sources"
    ],
    "choices_ger": [
      "Um lokale Datenquellen mit Power BI zu verbinden",
      "Um Visualisierungen zu erstellen",
      "Um Daten mit anderen Benutzern zu teilen",
      "Um Datenquellen zu verwalten"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q021",
    "content": [
      {
        "type": "text",
        "eng": "What is the purpose of a data model in Power BI?",
        "de": "Welchen Zweck hat ein Datenmodell in Power BI?"
      }
    ],
    "images": [],
    "choices": [
      "To organize and structure data for analysis",
      "To visualize data in a report",
      "To create dashboards for end users",
      "To import data from external sources"
    ],
    "choices_ger": [
      "Um Daten für die Analyse zu organisieren und zu strukturieren",
      "Um Daten in einem Bericht zu visualisieren",
      "Um Dashboards für Endbenutzer zu erstellen",
      "Um Daten aus externen Quellen zu importieren"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q022",
    "content": [
      {
        "type": "text",
        "eng": "In Power BI Desktop, you are building a sales report that contains two tables. Both tables have row-level security (RLS) configured. You need to create a relationship between the tables. The solution must ensure that bidirectional cross-filtering honors the RLS settings. What should you do?",
        "de": "In Power BI Desktop erstellen Sie einen Verkaufsbericht, der zwei Tabellen enthält. Beide Tabellen haben Zeilenebenen-Sicherheit (RLS) konfiguriert. Sie müssen eine Beziehung zwischen den Tabellen erstellen. Die Lösung muss sicherstellen, dass bidirektionales Cross-Filtering die RLS-Einstellungen berücksichtigt. Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Create an inactive relationship between the tables and select Apply security filter in both directions.",
      "Create an active relationship between the tables and select Apply security filter in both directions.",
      "Create an inactive relationship between the tables and select Assume referential integrity.",
      "Create an active relationship between the tables and select Assume referential integrity."
    ],
    "choices_ger": [
      "Eine inaktive Beziehung zwischen den Tabellen erstellen und 'Sicherheitsfilter in beide Richtungen anwenden' auswählen.",
      "Eine aktive Beziehung zwischen den Tabellen erstellen und 'Sicherheitsfilter in beide Richtungen anwenden' auswählen.",
      "Eine inaktive Beziehung zwischen den Tabellen erstellen und 'Referenzielle Integrität annehmen' auswählen.",
      "Eine aktive Beziehung zwischen den Tabellen erstellen und 'Referenzielle Integrität annehmen' auswählen."
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  },
  {
    "id": "q023",
    "content": [
      {
        "type": "text",
        "eng": "Your company has employees in 10 states.The company recently decided to associate each state to one of the following three regions: East, West, and North.You have a data model that contains employee information by state. The model does NOT include region information.You have a report that shows the employees by state.You need to view the employees by region as quickly as possible.What should you do?",
        "de": "Ihr Unternehmen hat Mitarbeiter in 10 Bundesstaaten. Das Unternehmen hat kürzlich beschlossen, jeden Bundesstaat einer der folgenden drei Regionen zuzuordnen: Ost, West und Nord.Sie haben ein Datenmodell, das Mitarbeiterinformationen nach Bundesstaat enthält. Das Modell enthält keine Regionsinformationen.Sie haben einen Bericht, der die Mitarbeiter nach Bundesstaat anzeigt.Sie müssen die Mitarbeiter nach Region so schnell wie möglich anzeigen.Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Create a new aggregation that summarizes by state.",
      "Create a new aggregation that summarizes by employee.",
      "Create a new group on the state column and set the Group type to List.",
      "Create a new group on the state column and set the Group type to Bin."
    ],
    "choices_ger": [
      "Eine neue Aggregation erstellen, die nach Bundesstaat zusammenfasst.",
      "Eine neue Aggregation erstellen, die nach Mitarbeiter zusammenfasst.",
      "Eine neue Gruppe in der Bundesstaatsspalte erstellen und den Gruppentyp auf 'Liste' setzen.",
      "Eine neue Gruppe in der Bundesstaatsspalte erstellen und den Gruppentyp auf 'Bin' setzen."
    ],
    "isMulti": false,
    "correct": [
      2
    ]
  },
  {
    "id": "q024",
    "content": [
      {
        "type": "text",
        "eng": "How can you create a measure in Power BI?",
        "de": "Wie kann man eine Kennzahl in Power BI erstellen?"
      }
    ],
    "images": [],
    "choices": [
      "Use the Power BI Desktop",
      "Use the Power BI Service",
      "Use the Power BI Mobile App",
      "Use Excel"
    ],
    "choices_ger": [
      "Power BI Desktop verwenden",
      "Power BI Service verwenden",
      "Power BI Mobile App verwenden",
      "Excel verwenden"
    ],
    "isMulti": true,
    "correct": [
      0,
      1
    ]
  },
  {
    "id": "q025",
    "content": [
      {
        "type": "text",
        "eng": "You want to show the distribution of customer ratings for a product. Which chart type would be best to use?",
        "de": "Sie möchten die Verteilung der Kundenbewertungen für ein Produkt anzeigen. Welcher Diagrammtyp wäre am besten geeignet?"
      }
    ],
    "images": [],
    "choices": [
      "Box plot",
      "Line chart",
      "Pie chart",
      "Scatter chart"
    ],
    "choices_ger": [
      "Boxplot",
      "Liniendiagramm",
      "Kreisdiagramm",
      "Streudiagramm"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q026",
    "content": [
      {
        "type": "text",
        "eng": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.You have a clustered bar chart that contains a measure named Salary as the value and a field named Employee as the axis. Salary is present in the data as a numerical amount representing US dollars.You need to create a reference line to show which employees are above the median salary.Solution: You create a constant line and set the value to .5.Does this meet the goal?",
        "de": "Hinweis: Diese Frage ist Teil einer Reihe von Fragen, die das gleiche Szenario darstellen. Jede Frage in der Reihe enthält eine eindeutige Lösung, die die angegebenen Ziele erreichen könnte. Einige Fragensätze haben möglicherweise mehr als eine korrekte Lösung, während andere möglicherweise keine korrekte Lösung haben.Nachdem Sie eine Frage in diesem Abschnitt beantwortet haben, können Sie NICHT mehr darauf zurückgreifen. Daher werden diese Fragen nicht im Überprüfungsbildschirm angezeigt.Sie haben ein gruppiertes Balkendiagramm, das eine Kennzahl namens 'Gehalt' als Wert und ein Feld namens 'Mitarbeiter' als Achse enthält. Das Gehalt ist in den Daten als numerischer Betrag in US-Dollar vorhanden.Sie müssen eine Referenzlinie erstellen, um anzuzeigen, welche Mitarbeiter über dem Mediangehalt liegen.Lösung: Sie erstellen eine konstante Linie und setzen den Wert auf 0,5.Erreicht dies das Ziel?"
      }
    ],
    "images": [],
    "choices": [
      "Yes",
      "No"
    ],
    "choices_ger": [
      "Ja",
      "Nein"
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  },
  {
    "id": "q027",
    "content": [
      {
        "type": "text",
        "eng": "You have a Power BI report that uses row-level security (RLS).You need to transfer RLS membership maintenance to an Azure network security team. The solution must NOT provide the Azure network security team with the ability to manage reports, datasets, or dashboards.What should you do?",
        "de": "Sie haben einen Power BI-Bericht, der Zeilenebenen-Sicherheit (RLS) verwendet.Sie müssen die Wartung der RLS-Mitgliedschaft an ein Azure-Netzwerksicherheitsteam übertragen. Die Lösung darf dem Azure-Netzwerksicherheitsteam NICHT die Möglichkeit geben, Berichte, Datensätze oder Dashboards zu verwalten.Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Grant the Read and Build permissions for the Power BI datasets to the Azure network security team",
      "Configure custom instructions for the Request access feature that instructs users to contact the Azure network security team.",
      "Instruct the Azure network security team to create security groups. Configure RLS to use the groups.",
      "Add the Azure network security team as members of the RLS role."
    ],
    "choices_ger": [
      "Dem Azure-Netzwerksicherheitsteam Lese- und Erstellungsberechtigungen für die Power BI-Datensätze gewähren",
      "Benutzerdefinierte Anweisungen für die Funktion 'Zugriff anfordern' konfigurieren, die Benutzer anweisen, sich an das Azure-Netzwerksicherheitsteam zu wenden.",
      "Das Azure-Netzwerksicherheitsteam anweisen, Sicherheitsgruppen zu erstellen. RLS so konfigurieren, dass es die Gruppen verwendet.",
      "Das Azure-Netzwerksicherheitsteam als Mitglieder der RLS-Rolle hinzufügen."
    ],
    "isMulti": false,
    "correct": [
      2
    ]
  },
  {
    "id": "q028",
    "content": [
      {
        "type": "text",
        "eng": "You have a Microsoft Excel file on a file server.You create a Power BI report and import a table from the Excel file.You publish the report.You need to ensure that the data refreshes every four hours.What should you do first?",
        "de": "Sie haben eine Microsoft Excel-Datei auf einem Dateiserver.Sie erstellen einen Power BI-Bericht und importieren eine Tabelle aus der Excel-Datei.Sie veröffentlichen den Bericht.Sie müssen sicherstellen, dass die Daten alle vier Stunden aktualisiert werden.Was sollten Sie zuerst tun?"
      }
    ],
    "images": [],
    "choices": [
      "Upload the Excel file to a Power BI workspace.",
      "Create a subscription to the report.",
      "Deploy an on-premises data gateway.",
      "Edit the data source credentials."
    ],
    "choices_ger": [
      "Die Excel-Datei in einen Power BI-Arbeitsbereich hochladen.",
      "Ein Abonnement für den Bericht erstellen.",
      "Ein lokales Datengateway bereitstellen.",
      "Die Datenquellen-Anmeldeinformationen bearbeiten."
    ],
    "isMulti": false,
    "correct": [
      2
    ]
  },
  {
    "id": "q029",
    "content": [
      {
        "type": "text",
        "eng": "In a project, you need to create a data model that can handle multiple languages. Which data type should you use for the language field?",
        "de": "In einem Projekt müssen Sie ein Datenmodell erstellen, das mehrere Sprachen verarbeiten kann. Welchen Datentyp sollten Sie für das Sprachfeld verwenden?"
      }
    ],
    "images": [],
    "choices": [
      "Text",
      "Choice",
      "Lookup",
      "Managed Metadata"
    ],
    "choices_ger": [
      "Text",
      "Auswahl",
      "Nachschlagen",
      "Verwaltete Metadaten"
    ],
    "isMulti": false,
    "correct": [
      3
    ]
  },
  {
    "id": "q030",
    "content": [
      {
        "type": "text",
        "eng": "You import two Microsoft Excel tables named Customer and Address into Power Query. Customer contains the following columns:✑ Customer ID✑ Customer Name✑ Phone✑ Email Address✑ Address IDAddress contains the following columns:✑ Address ID✑ Address Line 1✑ Address Line 2✑ City✑ State/Region✑ Country✑ Postal CodeEach Customer ID represents a unique customer in the Customer table. Each Address ID represents a unique address in the Address table.You need to create a query that has one row per customer. Each row must contain City, State/Region, and Country for each customer.What should you do?",
        "de": "Sie importieren zwei Microsoft Excel-Tabellen namens 'Customer' und 'Address' in Power Query. 'Customer' enthält die folgenden Spalten:✑ Customer ID✑ Customer Name✑ Phone✑ Email Address✑ Address ID'Address' enthält die folgenden Spalten:✑ Address ID✑ Address Line 1✑ Address Line 2✑ City✑ State/Region✑ Country✑ Postal CodeJede Customer ID repräsentiert einen eindeutigen Kunden in der Customer-Tabelle. Jede Address ID repräsentiert eine eindeutige Adresse in der Address-Tabelle.Sie müssen eine Abfrage erstellen, die eine Zeile pro Kunde enthält. Jede Zeile muss Stadt, Bundesstaat/Region und Land für jeden Kunden enthalten.Was sollten Sie tun?"
      }
    ],
    "images": [],
    "choices": [
      "Merge the Customer and Address tables.",
      "Group the Customer and Address tables by the Address ID column.",
      "Transpose the Customer and Address tables.",
      "Append the Customer and Address tables."
    ],
    "choices_ger": [
      "Die Customer- und Address-Tabellen zusammenführen.",
      "Die Customer- und Address-Tabellen nach der Address ID-Spalte gruppieren.",
      "Die Customer- und Address-Tabellen transponieren.",
      "Die Customer- und Address-Tabellen aneinanderhängen."
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q031",
    "content": [
      {
        "type": "text",
        "eng": "You are creating a Power BI report to analyze consumer purchasing patterns from a table named Transactions. The Transactions table contains a numeric field named Spend.You need to include a visual that identifies which fields have the greatest impact on Spend.Which type of visual should you use?",
        "de": "Sie erstellen einen Power BI-Bericht, um das Kaufverhalten von Verbrauchern anhand einer Tabelle namens 'Transactions' zu analysieren. Die Tabelle 'Transactions' enthält ein numerisches Feld namens 'Spend'.Sie müssen eine Visualisierung einbinden, die identifiziert, welche Felder den größten Einfluss auf 'Spend' haben.Welche Art von Visualisierung sollten Sie verwenden?"
      }
    ],
    "images": [],
    "choices": [
      "Q&A",
      "smart narrative",
      "decomposition tree",
      "key influencers"
    ],
    "choices_ger": [
      "Q&A",
      "Intelligente Erzählung",
      "Zerlegungsbaum",
      "Key Influencers"
    ],
    "isMulti": false,
    "correct": [
      3
    ]
  },
  {
    "id": "q032",
    "content": [
      {
        "type": "text",
        "eng": "How can you manage data sources in Power BI?",
        "de": "Wie können Sie Datenquellen in Power BI verwalten?"
      }
    ],
    "images": [],
    "choices": [
      "Add or remove data sources",
      "Edit data source credentials",
      "Refresh data sources",
      "Share data sources with other users"
    ],
    "choices_ger": [
      "Datenquellen hinzufügen oder entfernen",
      "Anmeldeinformationen der Datenquelle bearbeiten",
      "Datenquellen aktualisieren",
      "Datenquellen mit anderen Benutzern teilen"
    ],
    "isMulti": true,
    "correct": [
      0,
      1,
      2,
      3
    ]
  },
  {
    "id": "q033",
    "content": [
      {
        "type": "text",
        "eng": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.You have five reports and two dashboards in a workspace.You need to grant all organizational users read access to one dashboard and three reports.Solution: You assign all the users the Viewer role to the workspace.Does this meet the goal?",
        "de": "Hinweis: Diese Frage ist Teil einer Reihe von Fragen, die das gleiche Szenario darstellen. Jede Frage in der Reihe enthält eine eindeutige Lösung, die die angegebenen Ziele erreichen könnte. Einige Fragensätze haben möglicherweise mehr als eine korrekte Lösung, während andere möglicherweise keine korrekte Lösung haben.Nachdem Sie eine Frage in diesem Abschnitt beantwortet haben, können Sie NICHT mehr darauf zurückgreifen. Daher werden diese Fragen nicht im Überprüfungsbildschirm angezeigt.Sie haben fünf Berichte und zwei Dashboards in einem Arbeitsbereich.Sie müssen allen Benutzern der Organisation Lesezugriff auf ein Dashboard und drei Berichte gewähren.Lösung: Sie weisen allen Benutzern die Viewer-Rolle im Arbeitsbereich zu.Erreicht dies das Ziel?"
      }
    ],
    "images": [],
    "choices": [
      "Yes",
      "No"
    ],
    "choices_ger": [
      "Ja",
      "Nein"
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  },
  {
    "id": "q034",
    "content": [
      {
        "type": "text",
        "eng": "What is the purpose of the Power BI Mobile App?",
        "de": "Welchen Zweck hat die Power BI Mobile App?"
      }
    ],
    "images": [],
    "choices": [
      "To allow users to view and interact with Power BI reports on mobile devices",
      "To allow users to create custom visuals",
      "To allow users to share reports with others",
      "To allow users to create dashboards"
    ],
    "choices_ger": [
      "Benutzern das Anzeigen und Interagieren mit Power BI-Berichten auf mobilen Geräten zu ermöglichen",
      "Benutzern das Erstellen benutzerdefinierter Visualisierungen zu ermöglichen",
      "Benutzern das Teilen von Berichten mit anderen zu ermöglichen",
      "Benutzern das Erstellen von Dashboards zu ermöglichen"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q035",
    "content": [
      {
        "type": "text",
        "eng": "How can you ensure data privacy and security during analysis?",
        "de": "Wie können Sie Datenschutz und Sicherheit während der Analyse gewährleisten?"
      }
    ],
    "images": [],
    "choices": [
      "Use encryption and access controls",
      "Use data profiling tools",
      "Use data visualization tools",
      "Use data transformation tools"
    ],
    "choices_ger": [
      "Verschlüsselung und Zugriffskontrollen verwenden",
      "Datenprofilerstellungstools verwenden",
      "Datenvisualisierungstools verwenden",
      "Datenumwandlungstools verwenden"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q036",
    "content": [
      {
        "type": "text",
        "eng": "What is the best way to handle large datasets for analysis?",
        "de": "Was ist die beste Methode, um große Datensätze für die Analyse zu verarbeiten?"
      }
    ],
    "images": [],
    "choices": [
      "Use distributed computing systems",
      "Use data profiling tools",
      "Use data visualization tools",
      "Use data transformation tools"
    ],
    "choices_ger": [
      "Verteilte Rechensysteme verwenden",
      "Datenprofilerstellungstools verwenden",
      "Datenvisualisierungstools verwenden",
      "Datenumwandlungstools verwenden"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q037",
    "content": [
      {
        "type": "text",
        "eng": "You have a report that includes a card visualization.You need to apply the following conditional formatting to the card while minimizing design effort:✑ For values that are greater than or equal to 100, the font of the data label must be dark red.✑ For values that are less than 100, the font of the data label must be dark gray.Which type of format should you use?",
        "de": "Sie haben einen Bericht, der eine Kartenvisualisierung enthält.Sie müssen die folgende bedingte Formatierung auf die Karte anwenden, wobei der Gestaltungsaufwand minimiert werden soll:✑ Für Werte, die größer oder gleich 100 sind, muss die Schrift der Datenbeschriftung dunkelrot sein.✑ Für Werte, die kleiner als 100 sind, muss die Schrift der Datenbeschriftung dunkelgrau sein.Welche Art von Formatierung sollten Sie verwenden?"
      }
    ],
    "images": [],
    "choices": [
      "Color scale",
      "Rules",
      "Field value"
    ],
    "choices_ger": [
      "Farbskala",
      "Regeln",
      "Feldwert"
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  },
  {
    "id": "q038",
    "content": [
      {
        "type": "text",
        "eng": "You need to create a data source that can be used by Power Apps. Which type of data source should you use if you need to store large amounts of data?",
        "de": "Sie müssen eine Datenquelle erstellen, die von Power Apps verwendet werden kann. Welchen Typ von Datenquelle sollten Sie verwenden, wenn Sie große Datenmengen speichern müssen?"
      }
    ],
    "images": [],
    "choices": [
      "SQL Server",
      "Common Data Service",
      "SharePoint",
      "OneDrive"
    ],
    "choices_ger": [
      "SQL Server",
      "Common Data Service",
      "SharePoint",
      "OneDrive"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q039",
    "content": [
      {
        "type": "text",
        "eng": "You want to show the comparison of sales performance between different sales representatives. Which chart type would be best to use?",
        "de": "Sie möchten den Vergleich der Verkaufsleistung zwischen verschiedenen Vertriebsmitarbeitern zeigen. Welcher Diagrammtyp wäre am besten geeignet?"
      }
    ],
    "images": [],
    "choices": [
      "Bar chart",
      "Line chart",
      "Scatter chart",
      "Dual-axis chart"
    ],
    "choices_ger": [
      "Balkendiagramm",
      "Liniendiagramm",
      "Streudiagramm",
      "Diagramm mit zwei Achsen"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q040",
    "content": [
      {
        "type": "text",
        "eng": "How can you create a dataflow in Power BI?",
        "de": "Wie können Sie einen Dataflow in Power BI erstellen?"
      }
    ],
    "images": [],
    "choices": [
      "Connect to a data source",
      "Import data from a file",
      "Use Power Query to transform data",
      "Delete a dataflow"
    ],
    "choices_ger": [
      "Mit einer Datenquelle verbinden",
      "Daten aus einer Datei importieren",
      "Power Query zur Datenumwandlung verwenden",
      "Einen Dataflow löschen"
    ],
    "isMulti": true,
    "correct": [
      0,
      1,
      2
    ]
  },
  {
    "id": "q041",
    "content": [
      {
        "type": "text",
        "eng": "How can you create a relationship between two tables in Power BI?",
        "de": "Wie können Sie eine Beziehung zwischen zwei Tabellen in Power BI erstellen?"
      }
    ],
    "images": [],
    "choices": [
      "Use the Manage Relationships dialog box",
      "Use the Query Editor",
      "Use the Data Model view",
      "Use the Visualizations pane"
    ],
    "choices_ger": [
      "Den Dialog 'Beziehungen verwalten' verwenden",
      "Den Abfrage-Editor verwenden",
      "Die Datenmodellansicht verwenden",
      "Den Visualisierungsbereich verwenden"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q042",
    "content": [
      {
        "type": "text",
        "eng": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen. You have a Power BI report that imports a date table and a sales table from an Azure SQL database data source. The sales table has the following date foreign keys: ✑ Due Date ✑ Order Date ✑ Delivery Date You need to support the analysis of sales over time based on all the date foreign keys. Solution: You create measures that use the USERELATIONSHIP DAX function to filter sales on the active relationship between the sales table and the date table. Does this meet the goal?",
        "de": "Hinweis: Diese Frage ist Teil einer Reihe von Fragen, die das gleiche Szenario darstellen. Jede Frage in der Reihe enthält eine eindeutige Lösung, die die angegebenen Ziele erreichen könnte. Einige Fragensätze haben möglicherweise mehr als eine korrekte Lösung, während andere möglicherweise keine korrekte Lösung haben.Nachdem Sie eine Frage in diesem Abschnitt beantwortet haben, können Sie NICHT mehr darauf zurückgreifen. Daher werden diese Fragen nicht im Überprüfungsbildschirm angezeigt.Sie haben einen Power BI-Bericht, der eine Datumstabelle und eine Verkaufstabelle aus einer Azure SQL-Datenbank-Datenquelle importiert. Die Verkaufstabelle hat die folgenden Datums-Fremdschlüssel: ✑ Fälligkeitsdatum ✑ Bestelldatum ✑ LieferdatumSie müssen die Analyse der Verkäufe über die Zeit basierend auf allen Datums-Fremdschlüsseln unterstützen.Lösung: Sie erstellen Kennzahlen, die die USERELATIONSHIP DAX-Funktion verwenden, um die Verkäufe nach der aktiven Beziehung zwischen der Verkaufstabelle und der Datumstabelle zu filtern.Erreicht dies das Ziel?"
      }
    ],
    "images": [],
    "choices": [
      "Yes",
      "No"
    ],
    "choices_ger": [
      "Ja",
      "Nein"
    ],
    "isMulti": false,
    "correct": [
      0
    ]
  },
  {
    "id": "q043",
    "content": [
      {
        "type": "text",
        "eng": "How can you identify outliers in a dataset?",
        "de": "Wie können Sie Ausreißer in einem Datensatz identifizieren?"
      }
    ],
    "images": [],
    "choices": [
      "Use box plots",
      "Use scatter plots",
      "Use histograms",
      "Use bar charts"
    ],
    "choices_ger": [
      "Boxplots verwenden",
      "Streudiagramme verwenden",
      "Histogramme verwenden",
      "Balkendiagramme verwenden"
    ],
    "isMulti": true,
    "correct": [
      0,
      1,
      2
    ]
  },
  {
    "id": "q044",
    "content": [
      {
        "type": "text",
        "eng": "You create a report by using Microsoft Power BI Desktop.The report uses data from a Microsoft SQL Server Analysis Services (SSAS) cube located on your company‘s internal network.You plan to publish the report to the Power BI Service.What should you implement to ensure that users who consume the report from the Power BI Service have the most up-to-date data from the cube?",
        "de": "Sie erstellen einen Bericht mit Microsoft Power BI Desktop.Der Bericht verwendet Daten aus einem Microsoft SQL Server Analysis Services (SSAS)-Cube, der sich im internen Netzwerk Ihres Unternehmens befindet.Sie planen, den Bericht im Power BI Service zu veröffentlichen.Was sollten Sie implementieren, um sicherzustellen, dass Benutzer, die den Bericht aus dem Power BI Service abrufen, die aktuellsten Daten aus dem Cube erhalten?"
      }
    ],
    "images": [],
    "choices": [
      "an OData feed",
      "an On-premises data gateway",
      "a subscription",
      "a scheduled refresh of the dataset"
    ],
    "choices_ger": [
      "Einen OData-Feed",
      "Ein lokales Datengateway",
      "Ein Abonnement",
      "Eine geplante Aktualisierung des Datensatzes"
    ],
    "isMulti": false,
    "correct": [
      1
    ]
  }
]